{
  "posts": [
    {
      "id": 1,
      "title": "Fresh Reads Alert",
      "excerpt": "Fresh on the shelves, these books are invitations to expand your mind! Here's to the joy of learning and the exciting journey that awaits within the pages of these thought-provoking newly acquired books.",
      "content": "\u003Cp\u003EFresh on the shelves, these books are invitations to expand your mind! 📖🚀\u003C/p\u003E\u003Cp\u003EHere's to the joy of learning and the exciting journey that awaits us within the pages of these thought-provoking newly acquired books!📚\u003C/p\u003E",
      "category": "resource",
      "category_name": "New Resources",
      "date": "Jan 25, 2024",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post1/blog1.jpg",
      "tags": [
        "New Books",
        "Library Collection",
        "Reading",
        "Academic Resources"
      ],
      "views": 345,
      "likes": 42
    },
    {
      "id": 2,
      "title": "DROP EVERYTHING AND READ! 📖 DepEd rolls out 'Catch-up Fridays'📚",
      "excerpt": "Students will be immersed in printed text to sharpen reading comprehension, strengthen values, improve mental health awareness, and learn about peace education through DepEd's Catch-up Fridays initiative.",
      "content": "\u003Cp\u003EInstead of the regular class program, students will be immersed in the printed text to sharpen their reading comprehension, strengthen their sense of values, make them more mindful of both their physical and mental health, and introduce them to \"peace education\"✨\u003C/p\u003E\u003Cblockquote\u003E\u003Cp\u003E\"Reading is an exercise in empathy; an exercise in walking in someone else's shoes for a while\" –Malorie Blackman\u003C/p\u003E\u003C/blockquote\u003E",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "Jan 29, 2024",
      "read_time": "3 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post1/blog2.jpg",
      "tags": [
        "Reading Program",
        "DepEd",
        "Education",
        "Literacy",
        "Catch-up Fridays"
      ],
      "views": 521,
      "likes": 67
    },
    {
      "id": 3,
      "title": "Explore Free Access E-Books for Every Field of Interest📚",
      "excerpt": "Discover treasure troves of free open-access e-books across various subjects through platforms like DOAB, Project Gutenberg, Free Computer Books, and more - perfect for students, researchers, and lifelong learners.",
      "content": "\u003Cp\u003EIn today's digital age, the availability of free e-books has transformed the way we learn and explore new topics. Whether you're a student, a researcher, or someone with a passion for lifelong learning, there's a treasure trove of open-access e-books available for free. These resources span a wide range of subjects and are accessible to anyone with an internet connection. Let's take a closer look at some of the platforms that make this possible:\u003C/p\u003E\u003Ch3\u003EDirectory of Open Access Books (DOAB)\u003C/h3\u003E\u003Cp\u003EThe DOAB offers a curated collection of scholarly, peer-reviewed books covering a variety of academic disciplines. From history and philosophy to science and technology, there's something for everyone here.\u003C/p\u003E\u003Cp\u003EVisit: \u003Ca href=\"https://www.doabooks.org/\" style=\"color: green;\"\u003Ehttps://www.doabooks.org/\u003C/a\u003E\u003C/p\u003E\u003Ch3\u003EE-Books Directory\u003C/h3\u003E\u003Cp\u003EThis platform provides a comprehensive catalog of open-access e-books, documents, and lecture notes. It's perfect for students and professionals alike who are seeking reliable learning resources.\u003C/p\u003E\u003Cp\u003EVisit: \u003Ca href=\"https://www.e-booksdirectory.com/\" style=\"color: green;\"\u003Ehttps://www.e-booksdirectory.com/\u003C/a\u003E\u003C/p\u003E\u003Ch3\u003EFree Computer Books\u003C/h3\u003E\u003Cp\u003EDive into the world of information technology, computer science, mathematics, and more. Free Computer Books is a haven for tech enthusiasts and students alike, offering tutorials, lecture notes, and e-books on various IT-related topics.\u003C/p\u003E\u003Cp\u003EVisit: \u003Ca href=\"https://freecomputerbooks.com/\" style=\"color: green;\"\u003Ehttps://freecomputerbooks.com/\u003C/a\u003E\u003C/p\u003E\u003Ch3\u003EFree Tech Books\u003C/h3\u003E\u003Cp\u003EThis directory focuses on resources in computer science, engineering, and programming. It's an excellent starting point for those looking to sharpen their technical skills or explore programming languages.\u003C/p\u003E\u003Cp\u003EVisit: \u003Ca href=\"https://www.freetechbooks.com/\" style=\"color: green;\"\u003Ehttps://www.freetechbooks.com/\u003C/a\u003E\u003C/p\u003E\u003Ch3\u003ELibrary of Economics and Liberty (Econlib)\u003C/h3\u003E\u003Cp\u003EDedicated to advancing the study of economics and liberty, Econlib offers a unique collection of resources for students, educators, and researchers in economic thought.\u003C/p\u003E\u003Cp\u003EVisit: \u003Ca href=\"https://www.econlib.org/\" style=\"color: green;\"\u003Ehttps://www.econlib.org/\u003C/a\u003E\u003C/p\u003E\u003Ch3\u003EProject Gutenberg\u003C/h3\u003E\u003Cp\u003EAs the pioneer of digital literature, Project Gutenberg hosts over 60,000 free e-books, including classics, historical works, and literature in the public domain. It's the go-to place for timeless reads.\u003C/p\u003E\u003Cp\u003EVisit: \u003Ca href=\"https://www.gutenberg.org/\" style=\"color: green;\"\u003Ehttps://www.gutenberg.org/\u003C/a\u003E\u003C/p\u003E\u003Ch3\u003EWhy Access Open E-Books?\u003C/h3\u003E\u003Cul\u003E\u003Cli\u003ECost-Effective Learning: These resources are free, making education and research accessible to everyone.\u003C/li\u003E\u003Cli\u003EConvenience: Access e-books anytime, anywhere, without the need for physical storage.\u003C/li\u003E\u003Cli\u003EWide Variety: From academic research to leisure reading, there's something for every interest.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EStart exploring these platforms today and unlock the knowledge that's just a click away. With free e-books, the only limit is your curiosity!\u003C/p\u003E\u003Ch6\u003E#FreeEBooks #OpenAccess #LifelongLearning\u003C/h6\u003E",
      "category": "resource",
      "category_name": "New Resources",
      "date": "Feb 27, 2024",
      "read_time": "6 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post1/blog3.jpg",
      "tags": [
        "E-books",
        "Free Resources",
        "Open Access",
        "Digital Library",
        "Online Learning"
      ],
      "views": 789,
      "likes": 93
    },
    {
      "id": 4,
      "title": "Stay Cool While You Study! ❄️📚",
      "excerpt": "The Professional Library gets air conditioning upgrades thanks to generous contributions from the Class of 2023 and Aldersgate College Incorporated, ensuring a comfortable study environment.",
      "content": "\u003Cp\u003EGet ready to chill and study! The Aldersgate College Professional Library is getting an upgrade with air conditioning. Stay cool, everyone! 📚❄️\u003C/p\u003E\u003Ch3\u003EHeartfelt Thanks to the Class of 2023 and ACI for Enhancing the Professional Library!\u003C/h3\u003E\u003Cp\u003EThe Aldersgate College Learning Resource Center (ACLLRC) is thrilled to share a wonderful initiative led by the Class of 2023 in collaboration with the Aldersgate College Incorporated (ACI).\u003C/p\u003E\u003Cp\u003EAs a meaningful parting gift, the Class of 2023 generously provided two 2.5HP air conditioning units to the Professional Library. ACI joined this effort by contributing an additional 2.5HP unit, completing a project that ensures a cooler and more comfortable learning environment for our students.\u003C/p\u003E\u003Cp\u003EThis thoughtful contribution is more than just a gift—it's a testament to the class's dedication to fostering academic success and their gratitude for the institution that helped shape their journey.\u003C/p\u003E\u003Cp\u003EThe ACLLRC would like to express its deepest gratitude to the Class of 2023 and ACI for their generosity. Your efforts have significantly enhanced the Professional Library, making it a better space for research, study, and collaboration for current and future generations.\u003C/p\u003E\u003Cp\u003EThank you for leaving a legacy that will inspire others to give back to their school community.\u003C/p\u003E\u003Ch6\u003E#ThankYouClassOf2023 #ProfessionalLibraryUpgrade #ACLLRCNews\u003C/h6\u003E",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "Mar 8, 2024",
      "read_time": "4 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post1/blog4.jpg",
      "tags": [
        "Facility Upgrade",
        "Air Conditioning",
        "Alumni Support",
        "Study Environment"
      ],
      "views": 432,
      "likes": 58
    },
    {
      "id": 5,
      "title": "Enhancing Library Integrity: Chief Librarian's Participation in PLAI Seminar",
      "excerpt": "Chief Librarian Charline G. Barut attends PLAI seminar on integrating external policies and best practices for maintaining library service integrity at BSU La Trinidad.",
      "content": "\u003Cp\u003EThe Chief Librarian, Ma'am Charline G. Barut, participated in the Library Seminar on \"Integrating External Policies and Best Practices for Maintaining Integrity in Library Services,\" organized by the Philippine Librarians' Association, Inc. (PLAI) Cordillera Administrative Region Librarians Council (CARLC) on May 16-17, 2024, at BSU La Trinidad, Benguet.\u003C/p\u003E\u003Cp\u003EBy attending this seminar, the Chief Librarian had the opportunity to learn about the latest trends, policies, and best practices in library management. The seminar also allowed her to network with other librarians from the region and explore potential collaborations for enhancing library services.\u003C/p\u003E\u003Ch6\u003E#ACLLRC #ACLibrarians\u003C/h6\u003E",
      "category": "event",
      "category_name": "Events",
      "date": "May 21, 2024",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post1/blog5.jpg",
      "tags": [
        "Professional Development",
        "PLAI",
        "Library Management",
        "Networking"
      ],
      "views": 298,
      "likes": 37
    },
    {
      "id": 6,
      "title": "Advancing Library Services with KOHA ILS Training",
      "excerpt": "Library staff complete intensive KOHA Integrated Library System training at National Library of the Philippines, learning advanced tools to enhance services and streamline operations.",
      "content": "\u003Cp\u003EThe Aldersgate College Library & Learning Resource Center staff recently completed an intensive KOHA Integrated Library System (ILS) training, held from October 16–18, 2024, at the National Library of the Philippines. This hands-on workshop introduced advanced tools and methods to enhance library services and streamline operations.\u003C/p\u003E\u003Ch3\u003ESetting the Foundation\u003C/h3\u003E\u003Cp\u003EThe training kicked off with the installation of the Ubuntu operating system and the KOHA ILS using bash script commands. The session emphasized understanding the system's infrastructure and resolving technical errors, empowering the team to customize the platform to suit the library's unique requirements.\u003C/p\u003E\u003Ch3\u003EDiving into Cataloging and Patron Management\u003C/h3\u003E\u003Cp\u003EParticipants explored the cataloging module, gaining practical experience in creating and editing bibliographic records. The trainer also demonstrated KOHA's robust search and reporting tools. Further, staff learned to manage patron information, user permissions, and even implemented an in-out management system for monitoring library attendance.\u003C/p\u003E\u003Ch3\u003EMastering Circulation and Data Management\u003C/h3\u003E\u003Cp\u003EThe final day focused on the circulation module, which covered processes like book loans, returns, and managing fines. Importantly, the team learned how to integrate KOHA across a Local Area Network (LAN) and perform critical database backups to secure library data.\u003C/p\u003E\u003Cp\u003EThe training marked a significant step in modernizing the library's operations. By leveraging KOHA ILS, the Aldersgate College Professional Library aims to deliver more efficient and effective services, ensuring patrons have seamless access to information resources and an enriched library experience.\u003C/p\u003E\u003Cp\u003EStay tuned as we implement these advancements to better serve our community!\u003C/p\u003E\u003Ch6\u003E#LibraryInnovation #KOHAILS #AldersgateCollegeLibrary&LearningResourceCenter\u003C/h6\u003E",
      "category": "event",
      "category_name": "Events",
      "date": "Oct 19, 2024",
      "read_time": "5 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post1/blog6.1.jpg",
      "tags": [
        "Technology",
        "KOHA ILS",
        "Library Systems",
        "Staff Training",
        "Digital Transformation"
      ],
      "views": 567,
      "likes": 71
    },
    {
      "id": 7,
      "title": "📚 Faculty Book Evaluation in Progress! 📖",
      "excerpt": "Faculty members are invited to evaluate newly acquired books across departments for potential library purchase to help select valuable teaching and reference materials.",
      "content": "\u003Cp\u003EFaculty members are invited to evaluate newly acquired books across various departments for potential library purchase. Your recommendations will help us select valuable teaching and reference materials for students and faculty use.\u003C/p\u003E\u003Cp\u003E👉 Visit the Professional Library today and share your feedback!\u003C/p\u003E\u003Ch6\u003E#BookEvaluation #FacultyReview #LibraryResources #ProfessionalLibrary #TeachingMaterials #AcademicSupport\u003C/h6\u003E",
      "category": "event",
      "category_name": "Events",
      "date": "February 7, 2025",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post9/post9.1.jpg",
      "tags": [
        "Book Evaluation",
        "Faculty Collaboration",
        "Collection Development",
        "Academic Resources"
      ],
      "views": 412,
      "likes": 49
    },
    {
      "id": 8,
      "title": "📚 Successful Book Evaluation Completed! ✅",
      "excerpt": "Gratitude to faculty members who participated in book evaluation, helping select the best teaching and reference materials for the library collection.",
      "content": "\u003Cp\u003EWe would like to extend our gratitude to the faculty members from various departments who actively participated in the book evaluation at the Professional Library. Your valuable insights and recommendations have greatly contributed to ensuring that we select the best teaching and reference materials for our students and faculty.\u003C/p\u003E\u003Cp\u003EThe evaluation process helped us identify relevant and updated books that will soon be added to our collection, enhancing academic resources for everyone. 📖\u003C/p\u003E\u003Cp\u003EStay tuned for updates on the final list of newly purchased books! Thank you for supporting our mission of providing quality learning materials.\u003C/p\u003E\u003Ch6\u003E#BookEvaluation #FacultySupport #LibraryResources #AcademicGrowth #ProfessionalLibrary #ThankYouFaculty #NewBooksComing\u003C/h6\u003E",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "February 8, 2025",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post10/post10.1.jpg",
      "tags": [
        "Collection Development",
        "Faculty Appreciation",
        "New Acquisitions",
        "Academic Collaboration"
      ],
      "views": 387,
      "likes": 45
    },
    {
      "id": 9,
      "title": "Explore Our Latest Book Collection: New Arrivals for Your Academic Journey!",
      "excerpt": "New books added to collection for Nursing, CASE-IT, CBMA, Divinity, and Graduate Studies - valuable tools to enhance knowledge and skills across disciplines.",
      "content": "\u003Cp\u003E📚✨ New Arrivals! ✨📚 We've just expanded our collection with these amazing new books that will surely enhance our knowledge and skills. These books will be valuable tools in our learning journey. Drop by and check them out — your next favorite textbook might just be here! 📖💥\u003C/p\u003E\u003Ch6\u003E#NewBooks #StudentResources #LearningJourney #NURSING #CASE-IT #CBMA #DIVINITY #GRADUATE\u003C/h6\u003E",
      "category": "resource",
      "category_name": "New Resources",
      "date": "March 10, 2025",
      "read_time": "1 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post8/Post8.png",
      "tags": [
        "New Arrivals",
        "Book Collection",
        "Academic Disciplines",
        "Student Resources"
      ],
      "views": 523,
      "likes": 61
    },
    {
      "id": 10,
      "title": "Just In! Must-Read Books for Graduate Students",
      "excerpt": "Newly acquired books for graduate students in philosophy, sociology, public administration, and HR management now available at the library.",
      "content": "\u003Cp\u003EAttention graduate students! Our library has just expanded its collection with a range of newly acquired books in philosophy, sociology, public administration, human resource management, and public administration. These latest additions cover contemporary debates, classic theories, and cutting-edge research to support your academic journey. Visit the library to explore these resources. Stay ahead in your research with the use of the latest resources in ACLLRC.\u003C/p\u003E\u003Ch6\u003E#LibraryInnovation #KOHAILS #AldersgateCollegeLibrary&LearningResourceCenter\u003C/h6\u003E",
      "category": "resource",
      "category_name": "New Resources",
      "date": "March 11, 2025",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post7/post7.webp",
      "tags": [
        "Graduate Studies",
        "Research Resources",
        "Academic Books",
        "Higher Education"
      ],
      "views": 456,
      "likes": 53
    },
    {
      "id": 11,
      "title": "📢New Library Service: Library Research Clinic📢",
      "excerpt": "Introducing Library Research Clinic to support students in research proposal development and paper writing with expert guidance and research skill enhancement.",
      "content": "\u003Cdiv class=\"content\"\u003E\u003Ch3\u003ETitle: Library Research Clinic: Enhancing Student Research Skills\u003C/h3\u003E\u003Ch6\u003EIntroduction\u003C/h6\u003E\u003Cp\u003EThe Library Research Clinic is an initiative designed to support students in crafting their research proposals and writing research papers. This service aims to equip students with essential research skills, enhance their academic writing abilities, and provide them with access to expert guidance throughout the research process. The Library Research Clinic is a vital initiative that empowers students with the necessary research skills to excel in their academic pursuits. By fostering a research-supportive environment, this program will contribute to the overall academic success and scholarly engagement of students.\u003C/p\u003E\u003Ch6\u003EObjectives\u003C/h6\u003E\u003Col\u003E\u003Cli\u003ETo provide structured guidance on research proposal development.\u003C/li\u003E\u003Cli\u003ETo improve students' academic writing and citation skills.\u003C/li\u003E\u003Cli\u003ETo offer one-on-one mentorship and group workshops on research methodologies.\u003C/li\u003E\u003Cli\u003ETo familiarize students with library resources, including databases, citation tools, and research management software.\u003C/li\u003E\u003Cli\u003ETo create a collaborative learning environment for peer review and feedback.\u003C/li\u003E\u003C/ol\u003E\u003C/div\u003E",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "March 15, 2025",
      "read_time": "3 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "images/blog/Post11/post11.1.png",
      "tags": [
        "Research Support",
        "Student Services",
        "Academic Writing",
        "Research Skills",
        "Library Services"
      ],
      "views": 621,
      "likes": 78
    },
    {
      "id": 12,
      "title": "Blessed Beginnings: 40 New Computers for the E-Library",
      "excerpt": "Aldersgate College celebrates a new era of digital learning with the blessing of 40 new computers for the e-Library, led by Pastor Jomar Pastores.",
      "content": "<p>A momentous day for Aldersgate College Inc. as we celebrate the blessing of 40 new computers for our e-Library! This milestone, led by Pastor Jomar Pastores, marks a new era of digital learning and academic excellence.</p><p>May these resources empower our students and faculty in their pursuit of knowledge and innovation.</p>",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "April 4, 2025",
      "read_time": "1 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "assets/img/blog/Post12/post12.jpg",
      "tags": [
        "E-Library",
        "Technology Upgrade",
        "Digital Learning",
        "Computer Lab",
        "Academic Resources"
      ],
      "views": 275,
      "likes": 48
    },
    {
      "id": 13,
      "title": "Looking for Library Working Scholars - Apply Now!",
      "excerpt": "Aldersgate College is looking for dedicated students to join its Library Working Scholars Program. Gain valuable experience and support your education.",
      "content": "<p><strong>ALDERSGATE COLLEGE, INC</strong><br>BRIGGS ST., BRGY. QUISINO, SOLANO, NUEVA VIZCAYA, PHILIPPINES 3709</p><h3>WE ARE LOOKING FOR LIBRARY WORKING SCHOLARS</h3><p>Are you a dedicated and hardworking student looking for an opportunity to support your education?</p><p>Join our Scholarship Program and enjoy meaningful benefits while gaining valuable experience!</p><p><strong>APPLY NOW!</strong></p><p>For more information, please see Ma'am Charline Barut at the Professional Library.</p>",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "August 2, 2025",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "assets/img/blog/post13.jpg",
      "tags": [
        "Scholarship",
        "Student Employment",
        "Library Jobs",
        "Financial Aid",
        "Campus Opportunity"
      ],
      "views": 410,
      "likes": 65
    },
    {
      "id": 14,
      "title": "Happy Teachers Day!",
      "excerpt": "A celebration and heartfelt thank you to all educators for their endless dedication, patience, and passion that shapes lives beyond the classroom.",
      "content": "<p>To the incredible educators who inspire, shape, and guide us, today we celebrate YOU. Thank you for your endless dedication, patience, and passion for teaching. You not only impart knowledge but also instill the values of kindness, curiosity, and perseverance. Your impact goes beyond the classroom, and we are forever grateful for the wisdom you share and the lives you touch.</p><p>May your day be filled with love, appreciation, and the recognition you truly deserve. Here's to the teachers who make the world a better place, one lesson at a time!</p><h3>HAPPY TEACHERS DAY!</h3>",
      "category": "announcement",
      "category_name": "Announcements",
      "date": "October 5, 2025",
      "read_time": "1 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "assets/img/blog/post14.jpg",
      "tags": ["Teachers Day", "Appreciation", "Educators", "Thank You"],
      "views": 890,
      "likes": 120
    },
    {
      "id": 15,
      "title": "The RRL Hunt Made Easier: Useful Websites for Your Research",
      "excerpt": "Finding the perfect source for your Review of Related Literature (RRL) just got easier with this curated list of local and international academic websites and databases.",
      "content": "<p>We know the RRL hunt can be tough, but finding that perfect source just got a whole lot easier! Here is the list of useful websites:</p><h4>International & General Resources</h4><ol><li><strong>Google Scholar</strong></li><li><strong>Educational Resources Information Center (ERIC)</strong></li><li><strong>Virtual Learning Resources Center (VLRC)</strong></li></ol><h4>Local (Philippine) Resources</h4><ol><li><strong>Philippine Ejournal</strong></li><li><strong>Philippine Journal of Linguistics</strong></li><li><strong>National Library of the Philippines</strong></li><li><strong>Philippine Social Science Journal</strong></li><li><strong>Philippine Education Research Journal</strong></li></ol><p>Which one is your favorite discovery tool? Let us know!</p>",
      "category": "resource",
      "category_name": "New Resources",
      "date": "December 5, 2025",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "assets/img/blog/post15.jpg",
      "tags": [
        "Research Tools",
        "RRL",
        "Academic Databases",
        "Online Resources",
        "Philippine Journals"
      ],
      "views": 720,
      "likes": 95
    },
    {
      "id": 16,
      "title": "Mabuhay ang Kaalaman! Free Filipiniana Research Resources",
      "excerpt": "Discover a curated list of excellent free websites and digital libraries for conducting research on Filipino culture, history, socioeconomics, and science.",
      "content": "<p><strong>Mabuhay ang Kaalaman!</strong></p><p>Happy to Share FREE Filipiniana Resources! Here is the list of useful websites:</p><ol><li><strong>Filipinas Heritage Library</strong></li><li><strong>Socioeconomic Research Portal for the Philippines</strong></li><li><strong>Commission on Human Rights Library</strong></li><li><strong>DOST PCAARRD eLibrary</strong></li><li><strong>Southeast Asia Digital Library</strong></li><li><strong>SEAFDEC/AQD Repository</strong></li><li><strong>ADB Asian Development Bank</strong></li></ol><p>Which Filipiniana topic are you researching next? Let us know!</p>",
      "category": "resource",
      "category_name": "New Resources",
      "date": "December 5, 2025",
      "read_time": "2 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "assets/img/blog/post16.jpg",
      "tags": [
        "Filipiniana",
        "Research",
        "Free Resources",
        "Digital Libraries",
        "Philippine Studies"
      ],
      "views": 680,
      "likes": 88
    },
    {
      "id": 17,
      "title": "Institutional Book Fair 2025: A Celebration of National Book Week",
      "excerpt": "The library successfully held a three-day Institutional Book Fair from December 3–5, 2025, celebrating National Book Week and promoting reading, literacy, and lifelong learning.",
      "content": "<p>In celebration of National Book Week 2025, with the theme “Reading is the bridge to a future full of hope,” the library successfully organized an Institutional Book Fair held from December 3–5, 2025. This event forms part of our continuous advocacy to promote reading, literacy, and lifelong learning among our students, faculty, and staff.</p>",
      "category": "event",
      "category_name": "Events",
      "date": "December 8, 2025",
      "read_time": "1 min read",
      "author": "ACLLRC",
      "author_position": "Library Team",
      "image": "assets/img/blog/Post17/post17.jpg",
      "tags": [
        "National Book Week",
        "Book Fair",
        "Literacy",
        "Reading Advocacy",
        "Event"
      ],
      "views": 550,
      "likes": 72
    }
  ]
}
